Drzet/esp_icg/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ESP32-P4 rev1 hardware support
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# Camera frame buffers need fast PSRAM
CONFIG_SPIRAM=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# IMX708: CSI + ISP with IPA pipeline control for AE/AGC. AWB is disabled so
# the application can hold deterministic unity white-balance gains for ICG.
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_CAMERA_IMX708=y
CONFIG_CAMERA_IMX708_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_IMX708_MIPI_IF_FORMAT_INDEX_DEFAULT=0
CONFIG_ESP_IPA_AWB_ALGORITHM=n

# Explicitly disable sensors from the OV5647 prototype branch so a stale or
# regenerated sdkconfig cannot probe the wrong camera first.
CONFIG_CAMERA_OV5647=n
CONFIG_CAMERA_IMX219=n

# Keep the DW9807 exposed through esp_video so V4L2_CID_FOCUS_ABSOLUTE works,
# but do not let the IPA pipeline write its AF result into the motor. The AF
# algorithm may still compute a result; manual focus owns the actuator.
CONFIG_CAM_MOTOR_DW9807=y
CONFIG_ESP_IPA_AF_ALGORITHM=y
CONFIG_ESP_VIDEO_ENABLE_CAMERA_MOTOR_CONTROLLER=y
CONFIG_ESP_VIDEO_ISP_PIPELINE_CONTROL_CAMERA_MOTOR=n

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
